father("Василий Пташинская", "Григорий Пташинский").
mother("Жанна Михайлова", "Григорий Пташинский").
father("Василий Пташинская", "Юлия Пташинская").
mother("Жанна Михайлова", "Юлия Пташинская").
father("Валерий Михайлов", "Жанна Михайлова").
mother("Галина Широкова", "Жанна Михайлова").
father("Виталий Пташинский", "Василий Пташинская").
mother("Татьяна Фролова", "Василий Пташинская").
father("Василий Широков", "Галина Широкова").
mother("Прасковья Самсонова", "Галина Широкова").
father("Дмитрий Самсонов", "Прасковья Самсонова").
mother("Мария ", "Прасковья Самсонова").
father("Владимир Кузнецов", "Валерий Михайлов").
mother("Елизавета Михайлова", "Валерий Михайлов").
motherInLaw(B, D) :- father(A, B), mother(A, C), mother(C, D).
